{
	"state": [{
		"karnataka": {
      "title": "Karnataka",
      "map": "https://i.pinimg.com/564x/cb/6a/12/cb6a12851c637f3b78419210eeaa3d24.jpg",
      "about": "Karnataka is a state in the south western region of India. It was formed on 1 November 1956, with the passage of the States Reorganisation Act. Originally known as the State of Mysore, it was renamed Karnataka in 1973. The state corresponds to the Carnatic region. The capital and largest city is Bangalore.Karnataka is bordered by the Arabian Sea to the west, Goa to the northwest, Maharashtra to the north, Telangana to the northeast, Andhra Pradesh to the east, Tamil Nadu to the southeast, and Kerala to the south. The state covers an area of 191,976 square kilometres (74,122 sq mi), or 5.83 percent of the total geographical area of India. It is the sixth largest Indian state by area. With 61,130,704 inhabitants at the 2011 census, Karnataka is the eighth largest state by population, comprising 30 districts. Kannada, one of the classical languages of India, is the most widely spoken and official language of the state. Other languages spoken include Urdu, Konkani, Marathi, Tulu, Tamil, Telugu, Malayalam, Kodava and Beary. Karnataka also contains some of the only villages in India where Sanskrit is primarily spoken.The two main river systems of the state are the Krishna and its tributaries, the Bhima, Ghataprabha, Vedavathi, Malaprabha and Tungabhadra in North Karnataka; Sharavathi in Shimoga and the Kaveri and its tributaries, the Hemavati, Shimsha, Arkavati, Lakshmana Thirtha and Kabini, in the south. Most of these rivers flow out of Karnataka eastward, reaching the sea at the Bay of Bengal.Though several etymologies have been suggested for the name Karnataka, the generally accepted one is that Karnataka is derived from the Kannada words karu and nādu, meaning 'elevated land'. Karu Nadu may also be read as karu, meaning \"black\" and nadu, meaning \"region\", as a reference to the black cotton soil found in the Bayalu Seeme region of the state. The British used the word Carnatic, sometimes Karnatak, to describe both sides of peninsular India, south of the Krishna.",
      "districts": [
        {
          "bidar": {
            "title": "Bidar",
            "map": "https://5.imimg.com/data5/LI/TB/MY-6502514/pcd-pharma-500x500.jpg",
            "about": "Bidar is a hill top city in the north-eastern part of Karnataka state in India. It is the headquarters of the Bidar district which borders Maharashtra and Telangana. It is a rapidly urbanising city in the wider Bidar Metropolitan area. The city is well known for its many sites of architectural, historical and religious importance.Being located at the farthest of around 700 km (430 mi) from the state capital Bengaluru, it has been neglected by the state government for a long time. However, owing to its rich heritage, the city has a prominent place on the Archaeological Map of India. Picturesquely perched on the Deccan plateau, the Bidar fort is more than 500 years old and still standing strong.[6] According to the book \"Bidar Heritage\" published by the state Department of Archaeology, Museums and Heritage, of the 61 monuments listed by the department, about 30 are tombs located in and around Bidar city. explaining its nickname, \"City of Whispering Monuments\". The heritage sites in and around Bidar have become the major attraction for film shooting in recent years with Bollywood making visits apart from kannada film industry. Bidar is home for the second biggest Indian Air Force training centre in the country. The IAF Station Bidar is used for advanced jet training of prospective fighter pilots on BAe Hawk aircraft. Bidar city is known for its Bidri handicraft products, and its rich history. Bidar is also considered one of the holiest place for Sikh pilgrimage. Unlike other places in the region, Bidar is the coldest and wettest place in north Karnataka. For the year 2009-10, Bidar was ranked 22nd among the cleanest cities in India, and 5th cleanest in Karnataka. SH4 passes through Bidar and the whole city is integrated with 4 lane road. Ancient Karez System in the city have been recently discovered. The Karez (Qanat) is an underground network of aqueducts for water supply. The Bidar Karez, built in the 15th century, is more than 3 km (1.9 mi) long with 21 air vents.[11] Underground canals, built to connect underground water streams, were meant to provide drinking water to civilian settlements and the garrison inside the Bidar fort. This was necessary in a city where the soil was rocky and drilling wells was difficult."
          }
        }
      ]
		}
  }]
}